Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Quarkus Funqy link:https://knative.dev/docs/eventing[Knative Events] builds off of the xref:funqy-http.adoc[Funqy HTTP] extension to allow you to route and process Knative Events within a Funqy function.
ja_jp: Quarkus Funqy link:https://knative.dev/docs/eventing[Knative Events]は、 link:funqy-http.html[Funqy HTTP]エクステンションをベースに構築されており、Funqy関数内でKnativeイベントをルーティングして処理することができます。

source: Quarkus GitHub URL common base prefix.
ja_jp: Quarkus GitHub の URL の共通ベース接頭辞。

source: Quarkus Gradle plugin supports the generation of Uber-Jars by specifying a `quarkus.package.jar.type` argument as follows:
ja_jp: Quarkus Gradleプラグインは、以下のように `quarkus.package.jar.type` の引数を指定して Uber-Jar の生成をサポートしています。

source: Quarkus Gradle plugin supports the generation of Uber-Jars by specifying a `quarkus.package.type` argument as follows:
ja_jp: Quarkus Gradleプラグインは、以下のように `--uber-jar` 引数を指定して UberJar の生成をサポートしています。

source: Quarkus Insights Podcast
ja_jp: Quarkus Insights ポッドキャスト

source: Quarkus Insights Season 3 starting!
ja_jp: Quarkus Insights シーズン3スタート!

source: Quarkus Integration
ja_jp: Quarkus の統合

source: Quarkus Integration Testing
ja_jp: Quarkus統合テスト

source: Quarkus JBeret Extension
ja_jp: Quarkus JBeret エクステンション

source: Quarkus Kafka extension supports xref:deploying-to-kubernetes.adoc[Service Binding Specification for Kubernetes]. You can enable this by adding the `quarkus-kubernetes-service-binding` extension to your application.
ja_jp: Quarkus Kafka エクステンションは、xref:deploying-to-kubernetes.adoc[Service Binding Specification for Kubernetes] をサポートしています。アプリケーションに `quarkus-kubernetes-service-binding` エクステンションを追加することで、これを有効にすることができます。

source: Quarkus Keycloak Admin Client Configuration Reference
ja_jp: Quarkus Keycloak Admin クライアント設定リファレンス

source: Quarkus Log Participation
ja_jp: Quarkus ログへの参加

source: Quarkus Maven Plugin
ja_jp: Quarkus Mavenプラグイン

source: Quarkus Maven plugin - Go offline
ja_jp: Quarkus Mavenプラグイン - オフライン対応

source: Quarkus Maven plugin supports the generation of Uber-Jars by specifying a `quarkus.package.jar.type=uber-jar` configuration option in your `application.properties` (or `<quarkus.package.jar.type>uber-jar</quarkus.package.jar.type>` in your `pom.xml`).
ja_jp: Quarkus Mavenプラグインは、 `application.properties` （または `pom.xml` の `<quarkus.package.jar.type>uber-jar</quarkus.package.jar.type>` ）で `quarkus.package.jar.type=uber-jar` 設定オプションを指定することで、Uber-Jarの生成をサポートします。

source: Quarkus Maven plugin supports the generation of Uber-Jars by specifying a `quarkus.package.type=uber-jar` configuration option in your `application.properties` (or `<quarkus.package.type>uber-jar</quarkus.package.type>` in your `pom.xml`).
ja_jp: Quarkus Mavenプラグインは、 `application.properties` .Quarkus Mavenプラグインで `quarkus.package.type=uber-jar` 設定オプションを指定することで、UberJar の生成をサポートしています。

source: Quarkus Messaging Development Model
ja_jp: Quarkus Messaging 開発モデル

source: Quarkus Messaging Extensions
ja_jp: Quarkus Messagingエクステンション

source: Quarkus Messaging channels can be configured individually to use a specific TLS configuration:
ja_jp: Quarkus Messaging チャネルは、特定の TLS 設定を使用するように個別に設定できます。

source: Quarkus Messaging extensions provide simple but useful metrics to monitor the health of the messaging system. The xref:telemetry-micrometer.adoc[Micrometer extension] exposes these metrics.
ja_jp: Quarkus Messaging エクステンションは、メッセージングシステムのヘルスを監視するためのシンプルかつ便利なメトリクスを提供します。 xref:telemetry-micrometer.adoc[Micrometer エクステンション] はこれらのメトリクスを公開します。

source: Quarkus Messaging sits on top of the xref:quarkus-reactive-architecture.adoc#engine[reactive engine] of Quarkus and leverages link:{eclipse-vertx}[Eclipse Vert.x] to dispatch messages for processing. It supports three execution modes:
ja_jp: Quarkus Messaging は、Quarkus の xref:quarkus-reactive-architecture.adoc#engine[リアクティブエンジン] の上に配置され、リンク:{eclipse-vertx}[Eclipse Vert.x] を活用して処理用にメッセージをディスパッチします。 以下の 3 つの実行モードをサポートしています。

source: Quarkus Micro Image?
ja_jp: Quarkus マイクロイメージとは？

source: Quarkus Micrometer Prometheus output
ja_jp: Quarkus Micrometer Prometheus の出力

source: Quarkus Micrometer Prometheus output (as seen at `/q/metrics/`)
ja_jp: Quarkus Micrometer Prometheus 出力 (`/q/metrics/` での表示)

source: Quarkus Micrometer extensions are structured in the same way as the Micrometer project. The `quarkus-micrometer` extension provides core Micrometer support and runtime integration. Other Quarkus and Quarkiverse extensions use the Quarkus Micrometer extension to provide support for other monitoring systems.
ja_jp: Quarkus Micrometer エクステンションは、Micrometer プロジェクトと同じ構造になっています。 `quarkus-micrometer` エクステンションは、Micrometer のコアサポートとランタイムの統合を提供します。 他の Quarkus や Quarkiverse のエクステンションは、Quarkus Micrometer エクステンションを使用して、他のモニタリングシステムのサポートを提供します。

source: Quarkus Micrometer extensions are structured similarly to Micrometer itself: `quarkus-micrometer` provides core micrometer support and runtime integration and other Quarkus and Quarkiverse extensions bring in additional dependencies and requirements to support specific monitoring systems.
ja_jp: Quarkus MicrometerエクステンションはMicrometer 自身と同様に構成されています。 `quarkus-micrometer` はコア micrometer サポートとランタイム統合を提供し、その他のQuarkus、Quarkiverse エクステンションは特定のモニタリングシステムをサポートするための追加の依存関係や要件を提供します。

source: Quarkus Newsletter
ja_jp: Quarkus ニュースレター

source: Quarkus Newsletter #15 - December
ja_jp: Quarkus ニュースレター 第15号 - 12月

source: Quarkus Newsletter #64 - January
ja_jp: Quarkus ニュースレター #64 - 1月

source: Quarkus Newsletter #65 - February
ja_jp: Quarkusニュースレター #65 - 2月

source: Quarkus Newsletter #66 - March
ja_jp: Quarkus ニュースレター #66 - 3月

source: Quarkus OIDC `quarkus-oidc` extension provides a comprehensive, highly adaptable and configurable OIDC and OAuth2 adapter implementation. It supports many OIDC and OAuth2 providers, bearer access token and authorization code flows, various provider client authentication mechanisms, token verification and introspection requirements, and much more.
ja_jp: Quarkus OIDC `quarkus-oidc` エクステンションは、包括的で適応性が高く、設定可能な OIDC および OAuth2 アダプター実装を提供します。これは、多くの OIDC および OAuth2 プロバイダー、ベアラーアクセストークンおよび認可コードフロー、さまざまなプロバイダークライアント認証メカニズム、トークン検証およびイントロスペクション要件などをサポートしています。

source: Quarkus OIDC can not use the public key inlined in the token until it proves that the applications trusts the token certificate chain which contains this public key.
ja_jp: Quarkus OIDC は、この公開鍵を含むトークンの証明書チェーンをアプリケーションが信頼することを証明できるまで、トークン内にインライン化された公開鍵を使用することはできません。

source: Quarkus OIDC creates a `state` cookie when an authorization code flow is started and a `session` cookie when it is completed.
ja_jp: Quarkus OIDC は、認可コードフローが開始されるときに `state` Cookie を作成し、完了するときに `session` Cookie を作成します。

source: Quarkus OIDC creates a state cookie whose value must match the `state` query parameter passed between Quarkus and the OIDC provider during two redirects. In addition to the actual state value, the state cookie may need to keep the `nonce` value if an ID token is required to contain a `nonce` claim with `quarkus.oidc.authentication.nonce-required=true` and a Proof Key for Code Exchange (PKCE) `code-verifier` if PKCE is required with `quarkus.oidc.authentication.pkce-required=true`. Both of these values must be encrypted. In such cases, the state cookie is encrypted with a generated secret key but you can provide your own, typically a 32 characters long, state cookie encryption secret with `quarkus.oidc.authentication.state-secret`.
ja_jp: Quarkus OIDC は、2 回のリダイレクト中に Quarkus と OIDC プロバイダー間で渡される `state` クエリーパラメーターと値が一致しなければならない State Cookie を作成します。実際の状態値に加えて、`quarkus.oidc.authentication.nonce-required=true` で ID トークンに `nonce` クレームを含める必要がある場合は `nonce` 値を、`quarkus.oidc.authentication.pkce-required=true` で PKCE が必要な場合は Proof Key for Code Exchange (PKCE) の `code-verifier` を、State Cookie に保持する必要がある場合があります。これらの値は両方とも暗号化される必要があります。このような場合、State Cookie は生成された秘密鍵で暗号化されますが、通常は 32 文字の長さの独自の State Cookie 暗号化シークレットを `quarkus.oidc.authentication.state-secret` で提供することもできます。

source: Quarkus OIDC enforces the root certificate match, and also runs other certificate chain checks to confirm that each certificate in the chain is not expired, and correctly signed by the next certificate in the chain (except the root certificate).
ja_jp: Quarkus OIDC はルート証明書の一致を強制し、さらに他の証明書チェーンチェックを実行して、チェーン内の各証明書が期限切れでなく、チェーン内の次の証明書によって (ルート証明書を除く) 正しく署名されていることを確認します。

source: Quarkus OIDC has a concept of a `primary` token. The bearer access token is a primary token because it is the only token which is used in the bearer access token flow and it is used by the external client to access Quarkus. Bearer access token `is always verified`. ID token is a `primary` token in the authorizaion code flow - it represents the current authenticated user. ID token is `always verified`.
ja_jp: Quarkus OIDC には `プライマリー` トークンという概念があります。ベアラーアクセストークンは、ベアラーアクセストークンフローで使用される唯一のトークンであり、外部クライアントが Quarkus にアクセスするために使用されるため、プライマリートークンです。ベアラーアクセストークンは `常に検証されます`。ID トークンは認可コードフローにおける `プライマリー` トークンであり、現在認証されているユーザーを表します。ID トークンは `常に検証されます`。

source: Quarkus OIDC must decide which tenant configuration can support the current request and it provides many security-openid-connect-multitenancy.adoc#tenant-resolution[tenant resolution options]. Some of these resilution options must be enabled through the configuration.
ja_jp: Quarkus OIDC は、どのテナント設定が現在のリクエストをサポートできるかを決定する必要があり、多くの security-openid-connect-multitenancy.adoc#tenant-resolution[テナント解決オプション] を提供しています。これらの解決オプションの一部は、設定を通じて有効にする必要があります。

source: Quarkus OIDC provides a default token introspection and `UserInfo` cache for `all` OIDC tenants. For example, if you support GitHub and Strava OAuth2 authentication, the GitHib and Strava UserInfo responses can be stored in the same default cache, keyed by either GitHib or Strava access tokens. This cache is enabled by default with the `quarkus.oidc.default-token-cache-enabled` build-time property, but no entries are added to it unless you choose to cache either the token introspection or UserInfo or both in this cache.
ja_jp: Quarkus OIDC は、 `すべて` の OIDC テナントに対してデフォルトのトークンイントロスペクションおよび `UserInfo` キャッシュを提供します。たとえば、GitHub と Strava の OAuth2 認証をサポートしている場合、GitHub と Strava の UserInfo レスポンスを同じデフォルトキャッシュに保存でき、GitHub または Strava のアクセストークンをキーとして使用します。このキャッシュは `quarkus.oidc.default-token-cache-enabled` ビルド時プロパティーによってデフォルトで有効になりますが、トークンイントロスペクションまたは UserInfo (あるいはその両方) をこのキャッシュに保存することを選択しない限り、エントリーは追加されません。

source: Quarkus OIDC provides an initial https://datatracker.ietf.org/doc/rfc9728/[Protected Resource Metadata] support allowing a Quarkus endpoint to return a URL of the OIDC or OAuth2 provider that secures this endpoint. In turn, a client that requested the protected resource metadata can use its properties, such as an authorization server URL, to discover the provider's metadata and bootstrap itself to work with this provider, for example, to login SPA users and access Quarkus on their behalf with bearer access tokens.
ja_jp: Quarkus OIDC は初期の https://datatracker.ietf.org/doc/rfc9728/[保護されたリソースのメタデータ] サポートを提供しており、Quarkus エンドポイントがそのエンドポイントを保護する OIDC または OAuth2 プロバイダーの URL を返せるようにします。その結果、保護されたリソースのメタデータを要求したクライアントは、認可サーバー URL などのプロパティーを使用して、プロバイダーのメタデータを検出し、そのプロバイダーと連携するためのブートストラップを自身で行うことができます。たとえば、SPA ユーザーをログインさせ、ベアラーアクセストークンを使用して彼らに代わって Quarkus にアクセスすることができます。

source: Quarkus OIDC quarkus-oidc extension provides a comprehensive, highly adaptable and configurable OIDC and OAuth2 adapter implementation.
ja_jp: Quarkus OIDC `quarkus-oidc` エクステンションは、包括的で、非常に適応性が高く、設定可能な OIDC および OAuth2 アダプター実装を提供します。

source: Quarkus OIDC simplifies working with many xref:security-openid-connect-providers.adoc[well known OIDC and OAuth2 providers] by offering a `quarkus.oidc.provider` configuration option.
ja_jp: Quarkus OIDC は、 `quarkus.oidc.provider` 設定オプションを提供することで、多くの xref:security-openid-connect-providers.adoc[よく知られた OIDC および OAuth2 プロバイダー] との連携を簡素化します。

source: Quarkus OIDC supports such redirects by default but you are RECOMMENDED to disable it with `quarkus.oidc.follow-redirects=false` if you do not expect HTTP redirects during Quarkus OIDC communicating with the OIDC provider.
ja_jp: Quarkus OIDC はデフォルトでこのようなリダイレクトをサポートしていますが、Quarkus OIDC が OIDC プロバイダーと通信している間に HTTP リダイレクトが発生することを想定していない場合は、 `quarkus.oidc.follow-redirects=false` で無効にすることを推奨します。

source: Quarkus OIDC supports three standard OIDC logout options: <<rp-initiated-logout>>, <<back-channel-logout>>, and <<front-channel-logout>>, as well as a local logout option. See the xref:security-oidc-code-flow-authentication.adoc#logout-and-expiration[OIDC logout] section for more information.
ja_jp: Quarkus OIDC は、3 つの標準的な OIDC ログアウトオプション (<<rp-initiated-logout>>、<<back-channel-logout>>、および <<front-channel-logout>>) と、ローカルログアウトオプションをサポートしています。詳細は xref:security-oidc-code-flow-authentication.adoc#logout-and-expiration[OIDC ログアウト] セクションを参照してください。

source: Quarkus OIDC tenant configuration represents specific requirements associated with a single OIDC provider, an individual tenant or realm among multiple OIDC provider tenants or realms.
ja_jp: Quarkus OIDC テナント設定は、単一の OIDC プロバイダー、または複数の OIDC プロバイダーテナントやレルムの中の個々のテナントやレルムに関連付けられた特定の要件を表します。

source: Quarkus OIDC uses the refresh token to refresh the current ID and access tokens as part of its <<session-management,session management>> process.
ja_jp: Quarkus OIDC は、<<session-management,session management>> プロセスの一環として、リフレッシュトークンを使用し、現在の ID とアクセストークンを更新します。

source: Quarkus OpenID Connect `quarkus-oidc` extension also supports Bearer Token Authorization and uses `smallrye-jwt` to represent the bearer tokens as `JsonWebToken`, please read the xref:security-openid-connect.adoc[Using OpenID Connect to Protect Service Applications] guide for more information. OpenID Connect extension has to be used if the Quarkus application needs to authenticate the users using OIDC Authorization Code Flow, please read xref:security-openid-connect-web-authentication.adoc[Using OpenID Connect to Protect Web Applications] guide for more information.
ja_jp: Quarkus OpenId Connect `quarkus-oidc` エクステンションは、ベアラートークン認可もサポートしており、 `smallrye-jwt` を使用してベアラートークンを `JsonWebToken` として表現します。詳しくは link:security-openid-connect[Using OpenID Connect to Protect Service Applications] ガイドをご覧ください。OpenId Connect extensionは、QuarkusアプリケーションがOIDC Authorization Code Flowを使用してユーザーを認証する必要がある場合に使用する必要があります。詳しくは link:security-openid-connect-web-authentication[Using OpenID Connect to Protect Web Applications] ガイドをご覧ください。

source: Quarkus OpenID Connect `quarkus-oidc` extension also supports Bearer Token Authorization and uses `smallrye-jwt` to represent the bearer tokens as `JsonWebToken`. For more information, read the xref:security-oidc-bearer-token-authentication.adoc[OIDC Bearer token authentication] guide. OpenID Connect extension has to be used if the Quarkus application needs to authenticate the users using OIDC Authorization Code Flow. For more information, see xref:security-oidc-code-flow-authentication.adoc[OIDC code flow mechanism for protecting web applications]
ja_jp: Quarkus OpenID Connect `quarkus-oidc` エクステンションは、ベアラートークン認証にも対応しており、 `smallrye-jwt` を使用して、ベアラートークンを `JsonWebToken` として表します。 詳細については、 xref:security-oidc-bearer-token-authentication.adoc[OIDCベアラートークン認証] ガイドを参照してください。 Quarkus アプリケーションで OIDC 認可コードフローを使用してユーザーを認証する必要がある場合は、OpenID Connect エクステンションを使用する必要があります。 詳細については、 xref:security-oidc-code-flow-authentication.adoc[Webアプリケーションを保護するためのOIDCコードフロー] メカニズムを参照してください。

source: Quarkus OpenId Connect (OIDC) Expanded Configuration Reference
ja_jp: Quarkus OpenId Connect (OIDC) 詳細設定リファレンス

source: Quarkus OpenTelemetry configuration properties now have the `quarkus.otel.*` prefix.
ja_jp: Quarkus OpenTelemetry の設定プロパティには、接頭辞として `quarkus.otel.*` が追加されるようになりました。

source: Quarkus OpenTelemetry defaults to the standard OTLP exporter defined in OpenTelemetry.
ja_jp: Quarkus OpenTelemetryのデフォルトは、OpenTelemetryで定義されている標準的なOTLPエクスポーターです。

source: Quarkus Operator SDK to 7.7.3
ja_jp: Quarkus Operator SDK を 7.7.3 に

source: Quarkus Performance
ja_jp: Quarkus パフォーマンス

source: Quarkus Platform
ja_jp: Quarkusプラットフォーム

source: Quarkus Platform Artifacts
ja_jp: Quarkusプラットフォームのアーティファクト

source: Quarkus Platform BOM
ja_jp: QuarkusプラットフォームBOM

source: Quarkus Platform Descriptor
ja_jp: Quarkusプラットフォームディスクリプタ

source: Quarkus Platform Properties
ja_jp: Quarkusプラットフォームプロパティ

source: Quarkus Platform readiness
ja_jp: Quarkus Platformへの対応

source: Quarkus Property Taxonomy
ja_jp: Quarkus プロパティータクソノミー

source: Quarkus Qpid JMS to 2.12.0
ja_jp: Quarkus Qpid JMS を 2.12.0 に

source: Quarkus REST (formerly RESTEasy Reactive) and Jackson.
ja_jp: Quarkus REST (旧称 RESTEasy Reactive) と Jackson

source: Quarkus REST (formerly RESTEasy Reactive) and its Jackson support (to handle JSON) to serve the HTTP endpoint.
ja_jp: Quarkus REST (以前の RESTEasy Reactive) とその Jackson サポート (JSON を処理するため) による HTTP エンドポイントの提供。

source: Quarkus REST (formerly RESTEasy Reactive) and its Jackson support to handle JSON payloads
ja_jp: Quarkus REST（旧RESTEasy Reactive）と、そのJacksonサポートによるJSONペイロードの処理

source: Quarkus REST (formerly RESTEasy Reactive) includes supports for Mutiny types (e.g. `Uni` and `Multi`) out of the box.
ja_jp: Quarkus REST (旧称 RESTEasy Reactive) には、Mutiny タイプ (例: `Uni` および `Multi`) のサポートが標準で含まれています。

source: Quarkus REST (formerly RESTEasy Reactive) used to expose REST endpoints
ja_jp: RESTエンドポイントの公開に使用されるQuarkus REST（旧RESTEasy Reactive）

source: Quarkus REST (formerly RESTEasy Reactive), RESTEasy and Spring Web extension codestarts are part of https://github.com/quarkusio/quarkus/tree/main/independent-projects/tools/base-codestarts/src/main/resources/codestarts/quarkus/extension-codestarts[the base codestarts, window="_blank"].
ja_jp: Quarkus REST（旧RESTEasy Reactive）、RESTEasy、Spring Webエクステンションのコードスタートは、 link:https://github.com/quarkusio/quarkus/tree/main/independent-projects/tools/base-codestarts/src/main/resources/codestarts/quarkus/extension-codestarts[基本コードスタート] の一部です。

source: Quarkus REST Configuration Reference
ja_jp: Quarkus REST 設定リファレンス

source: Quarkus REST and REST Client interactions
ja_jp: Quarkus REST と REST クライアントのインタラクション

source: Quarkus REST client provides an embedded hostname verifier strategy to disable the hostname verification called `io.quarkus.restclient.NoopHostnameVerifier`.
ja_jp: Quarkus REST クライアントは、 `io.quarkus.restclient.NoopHostnameVerifier` と呼ばれるホスト名検証を無効にするための組込ホスト名検証ストラテジーを提供しています。

source: Quarkus REST does **not** support servlets. If your project depends on servlets you have to migrate them. A servlet-based JAX-RS implementation must support injections of these types with the `@Context` annotation: `ServletConfig`, `ServletContext`, `HttpServletRequest` and `HttpServletResponse`. Since Quarkus REST is not servlet-based these injections will not work.
ja_jp: Quarkus REST はサーブレットをサポートして *いません* 。 プロジェクトが servlet に依存している場合は、それらを移行する必要があります。 サーブレット・ベースの JAX-RS 実装では、 `@Context` アノテーションを使用して、これらの型の注入をサポートする必要があります： `ServletConfig` 、 `ServletContext` 、 `HttpServletRequest` 、および `HttpServletResponse` 。 RESTEasy Reactive はサーブレットベースではないため、これらの注入は機能しません。

source: Quarkus REST does not support the various custom annotation under the `org.jboss.resteasy.annotations` package.
ja_jp: Quarkus REST は、 `org.jboss.resteasy.annotations` パッケージの各種カスタムアノテーションには対応していません。

source: Quarkus REST is a new link:{jaxrsspec}[Jakarta REST (formerly known as JAX-RS)] implementation written from the ground up to work on our common https://vertx.io/[Vert.x] layer and is thus fully reactive, while also being very tightly integrated with Quarkus and consequently moving a lot of work to build time.
ja_jp: Quarkus RESTは、共通の link:https://vertx.io/[Vert.x] レイヤーで動作するようにゼロから書かれた新しい link:{jaxrsspec}[Jakarta REST (旧称 JAX-RS)] の実装で、完全にリアクティブです。 Quarkusと非常に緊密に統合されており、その結果、多くの作業をビルド時に移行できます。

source: Quarkus REST is implemented using two main thread types:
ja_jp: Quarkus REST は、主に 2 つのスレッドタイプを使用して実装されます。

source: Quarkus REST is naturally integrated with Mutiny.
ja_jp: Quarkus RESTは当然Mutinyと統合されています。

source: Quarkus REST natively supports the Mutiny reactive types e.g. `Uni` and `Multi`.
ja_jp: Quarkus RESTは、Mutinyのリアクティブ型（ `Uni` 、 `Multi` など）をネイティブでサポートしています。

source: Quarkus REST provides the link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/Cache.html[`@Cache`] and link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/NoCache.html[`@NoCache`] annotations to facilitate handling HTTP caching semantics, i.e. setting the 'Cache-Control' HTTP header.
ja_jp: Quarkus REST は link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/Cache.html[`@Cache`] および link:{resteasy-reactive-common-api}/org/jboss/resteasy/reactive/NoCache.html[`@NoCache`] アノテーションを提供し、 HTTP キャッシュセマンティクス ('Cache-Control' HTTP ヘッダーの設定) を容易にします。

source: Quarkus REST supports the use of the implementations of `java.time.Temporal` (like `java.time.LocalDateTime`) as query, path, or form params. Furthermore, it provides the `@org.jboss.resteasy.reactive.DateFormat` annotation, which can be used to set a custom expected pattern. Otherwise, the JDK's default format for each type is used implicitly.
ja_jp: Quarkus REST は、（ `java.time.LocalDateTime` のような） `java.time.Temporal` の実装をクエリー、パス、またはフォームのパラメーターとして使用することをサポートしています。さらに、 `@org.jboss.resteasy.reactive.DateFormat` アノテーションを提供し、これを使用してカスタムの期待パターンを設定することができます。指定しない場合は、JDKの各型のデフォルトフォーマットが暗黙的に使用されます。

source: Quarkus REST to serve HTTP requests
ja_jp: HTTP リクエストを処理する Quarkus REST

source: Quarkus REST: an implementation of Jakarta REST tailored for the Quarkus architecture. It follows a reactive-first approach but allows imperative code using the `@Blocking` annotation.
ja_jp: Quarkus REST: Quarkusアーキテクチャに合わせたJakarta RESTの実装です。 リアクティブファーストアプローチに従いますが、 `@Blocking` アノテーションを使用した命令型コードも可能です。

source: Quarkus Reactive Architecture
ja_jp: Quarkus リアクティブアーキテクチャ

source: Quarkus Security Dependency
ja_jp: Quarkus Security依存関係

source: Quarkus Security Events
ja_jp: Quarkus Security イベント

source: Quarkus Security JPA information
ja_jp: Quarkus Security JPA 情報

source: Quarkus Security Manager uses `HttpAuthenticationMechanism` to extract the authentication credentials from the HTTP request and delegates to `IdentityProvider` to complete the conversion of these credentials to `SecurityIdentity`.
ja_jp: Quarkus Security Managerは、 `HttpAuthenticationMechanism` を使用してHTTPリクエストから認証資格情報を抽出し、 `IdentityProvider` に委任して、これらの資格情報の `SecurityIdentity` への変換を完了させます。

source: Quarkus Security also supports the following authentication mechanisms through extensions:
ja_jp: Quarkus Security は、エクステンションによって、以下の認証メカニズムもサポートしています:

source: Quarkus Security also supports the following features:
ja_jp: Quarkus Securityは、以下の機能もサポートしています:

source: Quarkus Security architecture
ja_jp: Quarkus Security アーキテクチャー

source: Quarkus Security automatically uses public getter methods if they are available.
ja_jp: Quarkus Security は、パブリックゲッターメソッドが利用可能な場合はそれを自動的に使用します。

source: Quarkus Security can only pass public fields to a custom permission constructor.
ja_jp: Quarkus Security は、カスタム権限コンストラクターにパブリックフィールドのみを渡すことができます。

source: Quarkus Security customization
ja_jp: Quarkus Securityのカスタマイズ

source: Quarkus Security is a framework that provides the architecture, multiple authentication and authorization mechanisms, and other tools for you to build secure and production-quality Java applications.
ja_jp: Quarkus Securityでは、開発者がQuarkusアプリケーションの商用品質のセキュリティーを構築するためのアーキテクチャ、複数の認証および認可メカニズム、その他のツールを提供しているフレームワークです。

source: Quarkus Security is a framework that provides the architecture, multiple authentication and authorization mechanisms, and other tools to build secure and production-quality Java applications.
ja_jp: Quarkus Securityは、セキュアでプロダクション品質のJavaアプリケーションを構築するためのアーキテクチャ、複数の認証および認可メカニズム、その他のツールを提供するフレームワークです。
